In [11]:
import pandas as pd

In [12]:
df = pd.read_csv('Dataset/StudentsPerformance1.csv')

In [13]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,grade
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0,NaN
1,female,group C,some college,standard,completed,69.0,90.0,88.0,NaN
2,female,group B,master's degree,standard,none,90.0,95.0,93.0,NaN
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0,NaN
4,male,group C,some college,standard,none,76.0,78.0,75.0,NaN

In [14]:
# How many unique values r present in a column
df['gender'].unique()

array(['female', 'male'], dtype=object)

In [15]:
df['race/ethnicity'].unique()

array(['group B', 'group C', 'group A', 'group D', 'group E'],
      dtype=object)

# Turning categorical variables into numeric

In [9]:
ðŸ›‘# Using replace:

# df['gender'].replace(['male', 'female'], [1, 0], inplace=True)
# print(df['gender'])

0      0
1      0
2      0
3      1
4      1
      ..
995    0
996    1
997    0
998    0
999    0
Name: gender, Length: 1000, dtype: int64

In [16]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,grade
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0,NaN
1,female,group C,some college,standard,completed,69.0,90.0,88.0,NaN
2,female,group B,master's degree,standard,none,90.0,95.0,93.0,NaN
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0,NaN
4,male,group C,some college,standard,none,76.0,78.0,75.0,NaN

In [21]:
ðŸ›‘# Using 'get_dummies' method:

dummies = pd.get_dummies(df['gender'])

# concat the two dataframes -> df and dummies
concat = pd.concat([df, dummies], axis='columns')

# remove the original gender column
concat.drop(['gender'], axis = 1, inplace=True)

In [22]:
concat.head()

,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,grade,female,male
0,group B,bachelor's degree,standard,none,72.0,72.0,74.0,NaN,1,0
1,group C,some college,standard,completed,69.0,90.0,88.0,NaN,1,0
2,group B,master's degree,standard,none,90.0,95.0,93.0,NaN,1,0
3,group A,associate's degree,free/reduced,none,47.0,57.0,44.0,NaN,0,1
4,group C,some college,standard,none,76.0,78.0,75.0,NaN,0,1